s2.1-introduction-to-data-abstraction.org
#+PROPERTY: header-args  :cache yes
#+PROPERTY: header-args+  :exports both
#+title: 2.1 Introduction to data abstraction
#+options: num:nil

** Intro
Why do we want compound data in a programming language?
- to elevate the conceptual level at which we can design our programs
  - thanks to "glueing" pieces of data together into a /compound data object/, which can be manipulated as single conceptual unit
- to increase the modularity of our designs
  - /data abstraction/ is a general technique that helps to separate the way data objects are /represented/ from the way data objects are /used/ by the program
- to enhance the expressive power of our language
  - lets the program to manipulate with data objects without knowing its representation.

Abstraction is a technique for coping with complexity, and we will see how data abstractions enables us to erect suitable /abstraction barriers/ between different parts of a program.

A programming language should provide some kind of "glue":
- There are many possible kinds of glue
- we will discover how to form compound data using no special "data" operations, only procedures
- we will explore some convential techniques for representing sequences and trees
- /closure/ - glue should allow us to combine into data objects not only primitive data objects, but compound data objects as well
- compound data objects can serve as /conventional interfaces/ for combining program modules in mix-and-match ways.


/Symbolic expressions/ - data whose elementary parts can be arbitrary symbols rathen than only numbers.
- we explore various alternatives for representing sets of objects
- there are many ways in which a given data structure can be represented in terms of simpler objects
- choice of representation can have significant impact on the time and space requirements of processes

There is a problem of working with data that may be represented differently by different parts of a program.
- for that, /generic operations/ must handle different types of data.
- maintaining modularity in the presence of generic operations is more difficult and require more powerful abstractions
  - /data-directed programming/ is a technique that allows individual data representations to be designed in isolation and then combined /additively/ (without modification).

** 2.1 Introduction to Data Abstraction

/data abstraction/ is a methodology that enables us to isolate how a compound data object is used from the details of how it is constructed from more primitive data objects.

Basic idea is to structure the programs so that they operate on "abstract data", i.e. rely only on properties of data objects that are needed for computation. At the same time, a "concrete" data representation is defined independent of the program that use the data. The interface between these two parts will be a set of procedures, /selectors/ and /constructors/, that implement abstract data in terms of the concrete representation.


*** 2.1.1 Example: Arithmetic Operations for Rational Numbers
Using some /wishful thinking/, assume these selectors and constructors are available:
- ~(make-rat <n> <d>)~ returns the rational number whose numerator is integer ~<n>~ and denominator is integer ~<d>~
- ~(numer <x>)~ returns the numerator of the rational number ~<x>~
- ~(denom <x>)~ returns the denominator of the rational number ~<x>~

Now even without implementation, we could then add, subtract, multiply, divide, and test equality:

#+name: rat-operations
#+begin_src racket :exports code
  (define (add-rat x y)
    (make-rat (+ (* (numer x) (denom y))
		 (* (numer y) (denom x)))
	      (* (denom x) (denom y))))

  (define (sub-rat x y)
    (make-rat (- (* (numer x) (denom y))
		 (* (numer y) (denom x)))
	      (* (denom x) (denom y))))

  (define (mul-rat x y)
    (make-rat (* (numer x) (numer y))
	      (* (denom x) (denom y))))

  (define (div-rat x y)
    (make-rat (* (numer x) (denom y))
	      (* (denom x) (numer y))))

  (define (equal-rat? x y)
    (= (* (numer x) (denom y))
       (* (denom x) (numer y))))
#+end_src

#+RESULTS[f4bd5b47ae39a42e4bd6c54924b7b4c163a24913]: rat-operations
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-D74SO7/ob-racketF8lBjX.rkt:4:3: make-rat: unbound identifier
:   in: make-rat
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-D74SO7/ob-racketF8lBjX.rkt:4:3

To define ~make-rat~, ~numer~, and ~denom~, we need some glue.

**** Pairs
Compound structure called a /pair/ can be constructed with the ~cons~ procedure. ~car~ and ~cdr~ can be used to extract first and second element of the pair respectively.

#+begin_src racket 
  #lang sicp

  (define x (cons 1 2))
  (car x)
  (cdr x)
#+end_src

#+RESULTS[4bd9b949d534f5524ad37561079b0ae2e7e6265c]:
: 1
: 2

Data objects constructed from paris are called /list-structured/ data.

