s2.1-introduction-to-data-abstraction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-11 Sun 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2.1 Introduction to data abstraction</title>
<meta name="author" content="LMG" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">2.1 Introduction to data abstraction</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org53f726e">Intro</a></li>
<li><a href="#org36d95fd">2.1 Introduction to Data Abstraction</a>
<ul>
<li><a href="#org374b7c9">2.1.1 Example: Arithmetic Operations for Rational Numbers</a>
<ul>
<li><a href="#orga8438d6">Pairs</a></li>
<li><a href="#org81139aa">Representing rational numbers</a></li>
</ul>
</li>
<li><a href="#org9514708">2.1.2 Abstraction Barriers</a>
<ul>
<li><a href="#org1d86751">Exercise 2.2 - Representation for line segments in a plane</a></li>
<li><a href="#org303011b">Exercise 2.3 - Representation for rectangles in a plane</a></li>
</ul>
</li>
<li><a href="#org4dcf1e0">2.1.3 What Is Meant by Data?</a>
<ul>
<li><a href="#org868eb1b">Exercise 2.4 - alternative procedural representation for pairs</a></li>
<li><a href="#orgab507f0">Exercise 2.5 - Pair of nonnegative integers using only numbers and arithmetic operations</a></li>
<li><a href="#org8b319d2">Exercise 2.6 - Church numerals</a></li>
</ul>
</li>
<li><a href="#org65acd09">2.1.4 Extended Exercise: Interval Arithmetic</a>
<ul>
<li><a href="#orgd129157">Introduce interval arithmetic</a></li>
<li><a href="#orgc3601c2">Some operations implementation</a></li>
<li><a href="#orga9b62b3">Exercise 2.7 - Constructor and selectors</a></li>
<li><a href="#org58f3bbb">Exercise 2.8 - Difference of intervals</a></li>
<li><a href="#org8ed40ba">Exercise 2.9 - The width of an interval</a></li>
<li><a href="#org06ddeb9">Exercise 2.10 - Divide by interval spanning zero</a></li>
<li><a href="#org72a18db">Exercise 2.11 - Optimize <code>mul-interval</code></a></li>
<li><a href="#orgd7cfa66">Alternate constructors</a></li>
<li><a href="#orgfba6247">Exercise 2.12 - Center-percentage interface</a></li>
<li><a href="#org80b7078">Exercise 2.13 - Approximate product tolerance when percentages are small</a></li>
<li><a href="#org3f74a60">Different results for algebraically equivalent expressions</a></li>
<li><a href="#org70268a3"><span class="todo TODO">TODO</span> Exercise 2.14 - Demonstrate the bug</a></li>
<li><a href="#org9092b1c"><span class="todo TODO">TODO</span> Exercise 2.15</a></li>
<li><a href="#org3da999a"><span class="todo TODO">TODO</span> Exercise 2.16</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org53f726e" class="outline-2">
<h2 id="org53f726e">Intro</h2>
<div class="outline-text-2" id="text-org53f726e">
<p>
Why do we want compound data in a programming language?
</p>
<ul class="org-ul">
<li>to elevate the conceptual level at which we can design our programs
<ul class="org-ul">
<li>thanks to "glueing" pieces of data together into a <i>compound data object</i>, which can be manipulated as single conceptual unit</li>
</ul></li>
<li>to increase the modularity of our designs
<ul class="org-ul">
<li><i>data abstraction</i> is a general technique that helps to separate the way data objects are <i>represented</i> from the way data objects are <i>used</i> by the program</li>
</ul></li>
<li>to enhance the expressive power of our language
<ul class="org-ul">
<li>lets the program to manipulate with data objects without knowing its representation.</li>
</ul></li>
</ul>

<p>
Abstraction is a technique for coping with complexity, and we will see how data abstractions enables us to erect suitable <i>abstraction barriers</i> between different parts of a program.
</p>

<p>
A programming language should provide some kind of "glue":
</p>
<ul class="org-ul">
<li>There are many possible kinds of glue</li>
<li>we will discover how to form compound data using no special "data" operations, only procedures</li>
<li>we will explore some convential techniques for representing sequences and trees</li>
<li><i>closure</i> - glue should allow us to combine into data objects not only primitive data objects, but compound data objects as well</li>
<li>compound data objects can serve as <i>conventional interfaces</i> for combining program modules in mix-and-match ways.</li>
</ul>


<p>
<i>Symbolic expressions</i> - data whose elementary parts can be arbitrary symbols rathen than only numbers.
</p>
<ul class="org-ul">
<li>we explore various alternatives for representing sets of objects</li>
<li>there are many ways in which a given data structure can be represented in terms of simpler objects</li>
<li>choice of representation can have significant impact on the time and space requirements of processes</li>
</ul>

<p>
There is a problem of working with data that may be represented differently by different parts of a program.
</p>
<ul class="org-ul">
<li>for that, <i>generic operations</i> must handle different types of data.</li>
<li>maintaining modularity in the presence of generic operations is more difficult and require more powerful abstractions
<ul class="org-ul">
<li><i>data-directed programming</i> is a technique that allows individual data representations to be designed in isolation and then combined <i>additively</i> (without modification).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org36d95fd" class="outline-2">
<h2 id="org36d95fd">2.1 Introduction to Data Abstraction</h2>
<div class="outline-text-2" id="text-org36d95fd">
<p>
<i>data abstraction</i> is a methodology that enables us to isolate how a compound data object is used from the details of how it is constructed from more primitive data objects.
</p>

<p>
Basic idea is to structure the programs so that they operate on "abstract data", i.e. rely only on properties of data objects that are needed for computation. At the same time, a "concrete" data representation is defined independent of the program that use the data. The interface between these two parts will be a set of procedures, <i>selectors</i> and <i>constructors</i>, that implement abstract data in terms of the concrete representation.
</p>
</div>


<div id="outline-container-org374b7c9" class="outline-3">
<h3 id="org374b7c9">2.1.1 Example: Arithmetic Operations for Rational Numbers</h3>
<div class="outline-text-3" id="text-org374b7c9">
<p>
Using some <i>wishful thinking</i>, assume these selectors and constructors are available:
</p>
<ul class="org-ul">
<li><code>(make-rat &lt;n&gt; &lt;d&gt;)</code> returns the rational number whose numerator is integer <code>&lt;n&gt;</code> and denominator is integer <code>&lt;d&gt;</code></li>
<li><code>(numer &lt;x&gt;)</code> returns the numerator of the rational number <code>&lt;x&gt;</code></li>
<li><code>(denom &lt;x&gt;)</code> returns the denominator of the rational number <code>&lt;x&gt;</code></li>
</ul>

<p>
Now even without implementation, we could then add, subtract, multiply, divide, and test equality:
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org365fe1f">(define (add-rat x y)
  (make-rat (+ (* (numer x) (denom y))
	       (* (numer y) (denom x)))
	    (* (denom x) (denom y))))

(define (sub-rat x y)
  (make-rat (- (* (numer x) (denom y))
	       (* (numer y) (denom x)))
	    (* (denom x) (denom y))))

(define (mul-rat x y)
  (make-rat (* (numer x) (numer y))
	    (* (denom x) (denom y))))

(define (div-rat x y)
  (make-rat (* (numer x) (denom y))
	    (* (denom x) (numer y))))

(define (equal-rat? x y)
  (= (* (numer x) (denom y))
     (* (denom x) (numer y))))
</pre>
</div>

<p>
To define <code>make-rat</code>, <code>numer</code>, and <code>denom</code>, we need some glue.
</p>
</div>

<div id="outline-container-orga8438d6" class="outline-4">
<h4 id="orga8438d6">Pairs</h4>
<div class="outline-text-4" id="text-orga8438d6">
<p>
Compound structure called a <i>pair</i> can be constructed with the <code>cons</code> procedure. <code>car</code> and <code>cdr</code> can be used to extract first and second element of the pair respectively.
</p>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define x (cons 1 2))
(car x)
(cdr x)
</pre>
</div>

<pre class="example">
1
2
</pre>


<p>
Data objects constructed from paris are called <i>list-structured</i> data.
</p>
</div>
</div>

<div id="outline-container-org81139aa" class="outline-4">
<h4 id="org81139aa">Representing rational numbers</h4>
<div class="outline-text-4" id="text-org81139aa">
<div class="org-src-container">
<pre class="src src-racket" id="org2cae6e4">#lang sicp
(define (gcd a b)
  (if (zero? b)
      a
      (gcd b (remainder a b))))
(define (make-rat n d)
  (let ((norm-d (if (&lt; d 0) (- d) d))
	(norm-n (if (&lt; d 0) (- n) n))
	(c (gcd (abs n) (abs d))))
    (cons (/ norm-n c) (/ norm-d c))))
(define (numer x) (car x))
(define (denom x) (cdr x))
(define (print-rat x)
  (newline)
  (display (numer x))
  (display "/")
  (display (denom x)))

(define (add-rat x y)
  (make-rat (+ (* (numer x) (denom y))
	       (* (numer y) (denom x)))
	    (* (denom x) (denom y))))

(define (sub-rat x y)
  (make-rat (- (* (numer x) (denom y))
	       (* (numer y) (denom x)))
	    (* (denom x) (denom y))))

(define (mul-rat x y)
  (make-rat (* (numer x) (numer y))
	    (* (denom x) (denom y))))

(define (div-rat x y)
  (make-rat (* (numer x) (denom y))
	    (* (denom x) (numer y))))

(define (equal-rat? x y)
  (= (* (numer x) (denom y))
     (* (denom x) (numer y))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp
(define (gcd a b)
  (if (zero? b)
      a
      (gcd b (remainder a b))))
(define (make-rat n d)
  (let ((norm-d (if (&lt; d 0) (- d) d))
	(norm-n (if (&lt; d 0) (- n) n))
	(c (gcd (abs n) (abs d))))
    (cons (/ norm-n c) (/ norm-d c))))
(define (numer x) (car x))
(define (denom x) (cdr x))
(define (print-rat x)
  (newline)
  (display (numer x))
  (display "/")
  (display (denom x)))

(define (add-rat x y)
  (make-rat (+ (* (numer x) (denom y))
	       (* (numer y) (denom x)))
	    (* (denom x) (denom y))))

(define (sub-rat x y)
  (make-rat (- (* (numer x) (denom y))
	       (* (numer y) (denom x)))
	    (* (denom x) (denom y))))

(define (mul-rat x y)
  (make-rat (* (numer x) (numer y))
	    (* (denom x) (denom y))))

(define (div-rat x y)
  (make-rat (* (numer x) (denom y))
	    (* (denom x) (numer y))))

(define (equal-rat? x y)
  (= (* (numer x) (denom y))
     (* (denom x) (numer y))))
