s2.1-introduction-to-data-abstraction.org
**** Representing rational numbers

#+name: rat-lib0
#+begin_src racket :noweb yes :exports code
  #lang sicp
  (define (gcd a b)
    (if (zero? b)
	a
	(gcd b (remainder a b))))
  (define (make-rat n d)
    (let ((norm-d (if (< d 0) (- d) d))
	  (norm-n (if (< d 0) (- n) n))
	  (c (gcd (abs n) (abs d))))
      (cons (/ norm-n c) (/ norm-d c))))
  (define (numer x) (car x))
  (define (denom x) (cdr x))
  (define (print-rat x)
    (newline)
    (display (numer x))
    (display "/")
    (display (denom x)))

  <<rat-operations>>
#+end_src

#+RESULTS[8e57521e486dfc7546a68cfe3301039438c1e613]: rat-lib0

#+begin_src racket :noweb yes
  <<rat-lib0>>

  (define one-half (make-rat 1 2))
  (print-rat one-half)

  (define one-third (make-rat 1 3))

  (print-rat (add-rat one-half one-third))
  (print-rat (mul-rat one-half one-third))
  (print-rat (add-rat one-third one-third))

  (define neg-one-third (make-rat 1 -3))
  (define neg-one-half (make-rat -1 2))

  (print-rat (add-rat one-half neg-one-half))
  (print-rat (mul-rat one-half neg-one-third))
  (print-rat (mul-rat neg-one-third neg-one-third))
#+end_src

#+RESULTS[984f7fb89b5df01755cbf084bc0803292daf54f7]:
: 
: 1/2
: 5/6
: 1/6
: 2/3
: 0/1
: -1/6
: 1/9

*** 2.1.2 Abstraction Barriers
/Abstraction barriers/ isolate different "levels" of the system.
At each level, the barrier separates the programs that use the data abstraction from the programs that implement the data abstraction.
Procedures at each level are the interfaces that define the abstraction barriers and connect the different levels.

Advantages:
- programs are easier to maintain and modify - if dependence on the representation is confined by design to a very few program modules.
- allows flexibility to consider alterante implementations

**** Exercise 2.2 - Representation for line segments in a plane
Each segment is represented as a pair of points: a starting point and an endpoing point.
Forthermore, a point can be represented as a pair of numbers: the $x$ and $y$ coordinates.

***** Define a constructor ~make-segment~ and selectors ~start-segment~ and ~end-segment~
These define the representation of segments in terms of points.

***** Define a constructor ~make-point~ and selectors ~x-point~ and ~y-point~
These define the representation of points in terms of numbers

***** Define a procedure ~midpoint-segment~
~midpoint-segment~ takes a line segment as argument and returns its midpoint.
Midpoint - the point whose coordinates are the average of the coordinates of the endpoints.


#+begin_src racket
  #lang sicp

  (define (make-segment start-point end-point)
    (cons start-point end-point))

  (define (start-segment segment)
    (car segment))

  (define (end-segment segment)
    (cdr segment))

  (define (make-point x y)
    (cons x y))

  (define (x-point point)
    (car point))

  (define (y-point point)
    (cdr point))

  (define (midpoint-segment segment)
    (define (average a b) (/ (+ a b) 2))
    (make-point (average (x-point (start-segment segment))
			 (x-point (end-segment segment)))
		(average (y-point (start-segment segment))
			 (y-point (end-segment segment)))))

  (define (print-point p)
    (newline)
    (display "(")
    (display (x-point p))
    (display ",")
    (display (y-point p))
    (display ")"))

  (define segment1 (make-segment (make-point 0 0)
				 (make-point 1 4)))
  (print-point (midpoint-segment segment1))
  (define segment2 (make-segment (make-point 1 1)
				 (make-point 10 10)))
  (print-point (midpoint-segment segment2))
  (define segment3 (make-segment (make-point 1 -1)
				 (make-point -10 10)))
  (print-point (midpoint-segment segment3))
#+end_src

#+RESULTS[5f4d8bc810691adcbf0c43b080999ff60db9242a]:
: 
: (1/2,2)
: (11/2,11/2)
: (-9/2,9/2)

**** Exercise 2.3 - Representation for rectangles in a plane

#+name: ps-lib
#+begin_src racket :exports none
  #lang sicp

  (define (make-segment start-point end-point)
    (cons start-point end-point))

  (define (start-segment s)
    (car s))

  (define (end-segment s)
    (cdr s))

  (define (length-segment s)
    (define (square x) (* x x))
    (sqrt (+ (square (- (x-point (start-segment s))
			(x-point (end-segment s))))
	     (square (- (y-point (start-segment s))
			(y-point (end-segment s)))))))

  (define (make-point x y)
    (cons x y))

  (define (x-point point)
    (car point))

  (define (y-point point)
    (cdr point))

  (define (print-point p)
    (newline)
    (display "(")
    (display (x-point p))
    (display ",")
    (display (y-point p))
    (display ")"))

#+end_src

#+RESULTS[ba9ee25052a71e0517eed6c8ded0f02e3ac97514]: ps-lib

***** Implement a representation for rectangles in a plane
A rectangle is a quadrilateral with four right angles.
If we restrict rectangles only to those with sides parallel to axis, it can be represented using two points of any diagonal. Procedure ~make-rectangle~ accepts two end point of a diagonal and returns a rectangle.

Given that for both ~perimeter~ and ~area~ we need to know only two perpendicular sides, a ~side-rectangle~ procedure accepting a rectangle ~r~ and an arbitrary side number ~i~, and returning a segment representing a side. One important detail, is to define ~side-rectangle~ in a way to return perpendicular sides for any ~i~ and ~i+1~ sides.

For ~perimeter~ and ~area~ only two perpendicular sides is needed, so I did not bother with calculating sides 3 and 4.

First rectangles implementation:
#+name: rectangles-1
#+begin_src racket :noweb strip-export
  <<ps-lib>>
  (define (make-rectangle p1 p2)
    "Given two end points of a diagonal, returns a rectangle with sides perpendicular to axes."
    (cons p1 p2))

  (define (side-rectangle r i)
    "Returns a segment representation of side i. For any side i, i+1 is guaranteed to be perpendicular. Side 1 is arbitrary."
    (let ((diag-p1 (car r))
	  (diag-p2 (cdr r)))
      (cond ((> i 4) (side-rectangle r (+ 1 (remainder i 4))))
	    ((= i 1) (make-segment diag-p1
				   (make-point (x-point diag-p1) (y-point diag-p2))))
	    ((= i 2) (make-segment (make-point (x-point diag-p1) (y-point diag-p2))
				   diag-p2))
	    (else (error "Not implemented")))))

  <<user-code-snippet>>

  (define r1 (make-rectangle (make-point 0 0)
			     (make-point 1 1)))
  (define r2 (make-rectangle (make-point -2 -2)
			     (make-point 1 1)))
  (perimeter r1)
  (area r1)

  (perimeter r2)
  (area r2)

#+end_src

#+RESULTS[61a7de1d60cdd648f2cf63d4769a225bb05445a2]: rectangles-1
: 4
: 1
: 12
: 9


***** Create procedures for perimeter and area of a given rectangle
Acknowledging this is an exercise, I wonder if perimeter and area would be better if defined as dependent on the internal representation of rectangle, and to not bother with adding abstraction barriers to make such thin "levels"? This way you don't have too much design to worry about.

With ~side-rectangle~ as part of rectangle interface, the code to compute perimeter and area is as follows:
#+name: user-code-snippet
#+begin_src racket :exports code
  (define (perimeter r)
    (* 2
       (+ (length-segment (side-rectangle r 1))
	  (length-segment (side-rectangle r 2)))))

  (define (area r)
    (* (length-segment (side-rectangle r 1))
       (length-segment (side-rectangle r 2))))
#+end_src

#+RESULTS[1458c9316e917afe6214613a421085a364f77e84]: user-code-snippet
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-RKEWPb/ob-racketlJoyJn.rkt:5:9: length-segment: unbound identifier
:   in: length-segment
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-RKEWPb/ob-racketlJoyJn.rkt:5:9

The segment interface is extended with ~length-segment~ procedure:
#+name: length-segment
#+begin_src racket :exports code
  (define (length-segment s)
    (define (square x) (* x x))
    (sqrt (+ (square (- (x-point (start-segment s))
			(x-point (end-segment s))))
	     (square (- (y-point (start-segment s))
			(y-point (end-segment s)))))))
#+end_src

#+RESULTS[3aa051cd6e588f05b19e4e2e5db5f097bb0f7842]: length-segment
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-Fs0u1Z/ob-racketDr65WI.rkt:5:23: x-point: unbound identifier
:   in: x-point
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-Fs0u1Z/ob-racketDr65WI.rkt:5:23

