s2.1-introduction-to-data-abstraction.html

(define one-half (make-rat 1 2))
(print-rat one-half)

(define one-third (make-rat 1 3))

(print-rat (add-rat one-half one-third))
(print-rat (mul-rat one-half one-third))
(print-rat (add-rat one-third one-third))

(define neg-one-third (make-rat 1 -3))
(define neg-one-half (make-rat -1 2))

(print-rat (add-rat one-half neg-one-half))
(print-rat (mul-rat one-half neg-one-third))
(print-rat (mul-rat neg-one-third neg-one-third))
</pre>
</div>

<pre class="example">

1/2
5/6
1/6
2/3
0/1
-1/6
1/9
</pre>
</div>
</div>
</div>

<div id="outline-container-org9514708" class="outline-3">
<h3 id="org9514708">2.1.2 Abstraction Barriers</h3>
<div class="outline-text-3" id="text-org9514708">
<p>
<i>Abstraction barriers</i> isolate different "levels" of the system.
At each level, the barrier separates the programs that use the data abstraction from the programs that implement the data abstraction.
Procedures at each level are the interfaces that define the abstraction barriers and connect the different levels.
</p>

<p>
Advantages:
</p>
<ul class="org-ul">
<li>programs are easier to maintain and modify - if dependence on the representation is confined by design to a very few program modules.</li>
<li>allows flexibility to consider alterante implementations</li>
</ul>
</div>

<div id="outline-container-org1d86751" class="outline-4">
<h4 id="org1d86751">Exercise 2.2 - Representation for line segments in a plane</h4>
<div class="outline-text-4" id="text-org1d86751">
<p>
Each segment is represented as a pair of points: a starting point and an endpoing point.
Forthermore, a point can be represented as a pair of numbers: the \(x\) and \(y\) coordinates.
</p>
</div>

<ul class="org-ul">
<li><a id="orga921341"></a>Define a constructor <code>make-segment</code> and selectors <code>start-segment</code> and <code>end-segment</code><br />
<div class="outline-text-5" id="text-orga921341">
<p>
These define the representation of segments in terms of points.
</p>
</div>
</li>

<li><a id="org8516a8c"></a>Define a constructor <code>make-point</code> and selectors <code>x-point</code> and <code>y-point</code><br />
<div class="outline-text-5" id="text-org8516a8c">
<p>
These define the representation of points in terms of numbers
</p>
</div>
</li>

<li><a id="org321f256"></a>Define a procedure <code>midpoint-segment</code><br />
<div class="outline-text-5" id="text-org321f256">
<p>
<code>midpoint-segment</code> takes a line segment as argument and returns its midpoint.
Midpoint - the point whose coordinates are the average of the coordinates of the endpoints.
</p>


<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (make-segment start-point end-point)
  (cons start-point end-point))

(define (start-segment segment)
  (car segment))

(define (end-segment segment)
  (cdr segment))

(define (make-point x y)
  (cons x y))

(define (x-point point)
  (car point))

(define (y-point point)
  (cdr point))

(define (midpoint-segment segment)
  (define (average a b) (/ (+ a b) 2))
  (make-point (average (x-point (start-segment segment))
		       (x-point (end-segment segment)))
	      (average (y-point (start-segment segment))
		       (y-point (end-segment segment)))))

(define (print-point p)
  (newline)
  (display "(")
  (display (x-point p))
  (display ",")
  (display (y-point p))
  (display ")"))

(define segment1 (make-segment (make-point 0 0)
			       (make-point 1 4)))
(print-point (midpoint-segment segment1))
(define segment2 (make-segment (make-point 1 1)
			       (make-point 10 10)))
(print-point (midpoint-segment segment2))
(define segment3 (make-segment (make-point 1 -1)
			       (make-point -10 10)))
(print-point (midpoint-segment segment3))
</pre>
</div>

<pre class="example">

(1/2,2)
(11/2,11/2)
(-9/2,9/2)
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-org303011b" class="outline-4">
<h4 id="org303011b">Exercise 2.3 - Representation for rectangles in a plane</h4>
<div class="outline-text-4" id="text-org303011b">
</div>
<ul class="org-ul">
<li><a id="orgd2c1841"></a>Implement a representation for rectangles in a plane<br />
<div class="outline-text-5" id="text-orgd2c1841">
<p>
A rectangle is a quadrilateral with four right angles.
If we restrict rectangles only to those with sides parallel to axis, it can be represented using two points of any diagonal. Procedure <code>make-rectangle</code> accepts two end point of a diagonal and returns a rectangle.
</p>

<p>
Given that for both <code>perimeter</code> and <code>area</code> we need to know only two perpendicular sides, a <code>side-rectangle</code> procedure accepting a rectangle <code>r</code> and an arbitrary side number <code>i</code>, and returning a segment representing a side. One important detail, is to define <code>side-rectangle</code> in a way to return perpendicular sides for any <code>i</code> and <code>i+1</code> sides.
</p>

<p>
For <code>perimeter</code> and <code>area</code> only two perpendicular sides is needed, so I did not bother with calculating sides 3 and 4.
</p>

<p>
First rectangles implementation:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="orgca0b816">
(define (make-rectangle p1 p2)
  "Given two end points of a diagonal, returns a rectangle with sides perpendicular to axes."
  (cons p1 p2))

(define (side-rectangle r i)
  "Returns a segment representation of side i. For any side i, i+1 is guaranteed to be perpendicular. Side 1 is arbitrary."
  (let ((diag-p1 (car r))
	(diag-p2 (cdr r)))
    (cond ((&gt; i 4) (side-rectangle r (+ 1 (remainder i 4))))
	  ((= i 1) (make-segment diag-p1
				 (make-point (x-point diag-p1) (y-point diag-p2))))
	  ((= i 2) (make-segment (make-point (x-point diag-p1) (y-point diag-p2))
				 diag-p2))
	  (else (error "Not implemented")))))



(define r1 (make-rectangle (make-point 0 0)
			   (make-point 1 1)))
(define r2 (make-rectangle (make-point -2 -2)
			   (make-point 1 1)))
(perimeter r1)
(area r1)

(perimeter r2)
(area r2)

</pre>
</div>

<pre class="example">
4
1
12
9
</pre>
</div>
</li>


<li><a id="org7ade161"></a>Create procedures for perimeter and area of a given rectangle<br />
<div class="outline-text-5" id="text-org7ade161">
<p>
Acknowledging this is an exercise, I wonder if perimeter and area would be better if defined as dependent on the internal representation of rectangle, and to not bother with adding abstraction barriers to make such thin "levels"? This way you don't have too much design to worry about.
</p>

<p>
With <code>side-rectangle</code> as part of rectangle interface, the code to compute perimeter and area is as follows:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="orgb116bfb">(define (perimeter r)
  (* 2
     (+ (length-segment (side-rectangle r 1))
	(length-segment (side-rectangle r 2)))))

(define (area r)
  (* (length-segment (side-rectangle r 1))
     (length-segment (side-rectangle r 2))))
</pre>
</div>

<p>
The segment interface is extended with <code>length-segment</code> procedure:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="orged3b85d">(define (length-segment s)
  (define (square x) (* x x))
  (sqrt (+ (square (- (x-point (start-segment s))
		      (x-point (end-segment s))))
	   (square (- (y-point (start-segment s))
		      (y-point (end-segment s)))))))
</pre>
</div>
</div>
</li>
