s2.1-introduction-to-data-abstraction.org
***** Implement a /different/ representation for rectangles
Can you design your system with suitable abstraction barriers, so that the same perimeter and area procedures will work using either representation.

As a second approach, I tried to lift the "sides parallel to axis" restriction, and considered several approaches to the design problem:
1) represent as two perpendicular edges
2) represent as 3 vertices
3) represent as a diagonal and an vertex not no that diagonal

All of them are a twist on 3-verices problem, but it was the easiest to "calculate" two perpendicular sides needed for ~perimeter~ and ~area~ with the approach #1 (just return the internal representation).

The same procedure ~side-rectangle~ remains as a part of rectangle data abstraction, and ~perimeter~ and ~area~ are work appropriately using the new rectangle implementation.

#+name: rectangles-2
#+begin_src racket :noweb strip-export
  <<ps-lib>>
  (define (make-rectangle s1 s2)
    "Given two perpendicular sides, returns a rectangle."
    (cons s1 s2))

  (define (side-rectangle r i)
    "Returns a segment representation of side i. For any side i, i+1 is guaranteed to be perpendicular. Side 1 is arbitrary."
    (let ((s1 (car r))
	  (s2 (cdr r)))
      (cond ((> i 4) (side-rectangle r (+ 1 (remainder i 4))))
	    ((= i 1) s1)
	    ((= i 2) s2)
	    (else (error "Not implemented")))))
  <<user-code-snippet>>
  (define r1 (make-rectangle (make-segment (make-point 0 0)
					   (make-point 0 1))
			     (make-segment (make-point 0 1)
					   (make-point 1 1))))
  (define r2 (make-rectangle (make-segment (make-point -2 -2)
					   (make-point -2 1))
			     (make-segment (make-point -2 1)
					   (make-point 1 1))))

  (perimeter r1)
  (area r1)

  (perimeter r2)
  (area r2)

  (define r3 (make-rectangle (make-segment (make-point 0 0)
					   (make-point -3 3))
			     (make-segment (make-point -3 3)
					   (make-point 2 8))))
  (define r4 (make-rectangle (make-segment (make-point 0 0)
					   (make-point 0 3))
			     (make-segment (make-point 0 3)
					   (make-point 4 3))))
  (perimeter r3)
  (area r3)

  (perimeter r4)
  (area r4)

#+end_src

#+RESULTS[e5cea60a11c92837373df6215033da6ef759c7b6]: rectangles-2
: 4
: 1
: 12
: 9
: 22.62741699796952
: 30.0
: 14
: 12

*** 2.1.3 What Is Meant by Data?

/Data/ is defined by a collection of selectors and constructors, together with specified condition these procedures must fullfill for representation to be valid.

For example, we have ~cons~, ~car~, and ~cdr~ procedures to manipulate with pairs. If ~x~ is defined to be ~(cons a b)~, then ~(car x)~ must be ~a~, and ~(cdr x)~ must be ~b~.

We can implement pair procedures with only procedures:

#+begin_src racket
  #lang sicp

  (define (-cons x y)
    (define (dispatch m)
      (cond ((= m 0) x)
	    ((= m 1) y)
	    (else (error "Argument not 0 or 1 --- CONS" m))))
    dispatch)

  (define (-car p) (p 0))
  (define (-cdr p) (p 1))

  (define p (-cons 1 10))
  (-car p)
  (-cdr p)
#+end_src

#+RESULTS[4741e9d7c7f9ac6f9244a5b41cb8a43729510297]:
: 1
: 10

**** Exercise 2.4 - alternative procedural representation for pairs

#+begin_src racket
  #lang sicp

  (define (cons x y)
    (lambda (m) (m x y)))

  (define (car z)
    (z (lambda (p q) p)))

  (define (cdr z)
    (z (lambda (p q) q)))

  (= 1 (car (cons 1 2)))
  (= 2 (cdr (cons 1 2)))
  
  ;; (define z (cons 1 2))
  ;; - (define z (lambda (m) (m 1 2)))
  ;; (car z)
  ;; - (car (lambda (m) (m 1 2)))
  ;; -- ((lambda (m) (m 1 2)) (lambda (p q) p))
  ;; --- ((lambda (p q) p) 1 2)
  ;; ----1
#+end_src

#+RESULTS[1dc24bd7e7ea34696a519cb9dc2924497911968e]:
: #t
: #t

**** Exercise 2.5 - Pair of nonnegative integers using only numbers and arithmetic operations
Represent the pair $a$ and $b$ as the integer that is the product $2^a * 3^b$

#+begin_src racket
  #lang sicp

  (define (pow b p)
    (define (square x) (* x x))
    (cond ((zero? p) 1)
	  ((even? p)
	   (square (pow b (/ p 2))))
	  (else
	   (* b (pow b (- p 1))))))

  (define (cons a b)
    (* (pow 2 a)
       (pow 3 b)))

  (define (car p)
    (cond ((= 1 p) 0)
	  ((zero? (remainder p 3))
	   (car (/ p 3)))
	  ((zero? (remainder p 2))
	   (inc (car (/ p 2))))))

  (define (cdr p)
    (cond ((= 1 p) 0)
	  ((zero? (remainder p 2))
	   (cdr (/ p 2)))
	  ((zero? (remainder p 3))
	   (inc (cdr (/ p 3))))))

  (= 3 (car (cons 3 6)))
  (= 6 (cdr (cons 3 6)))
#+end_src

#+RESULTS[7427ae41332e4b362b647ce82ed94e14fd85d9a0]:
: #t
: #t

**** Exercise 2.6 - Church numerals

#+begin_src racket
  #lang sicp

  (define zero (lambda (f) (lambda (x) x)))
  (define (add-1 n)
    (lambda (f) (lambda (x) (f ((n f) x)))))

  ; (define one (add-1 zero))
  ; (define one (add-1 (lambda (f) (lambda (x) x))))
  (define one
    (lambda (f)
      (lambda (x)
	; (f (((lambda (f) (lambda (x) x)) f) x)))))
	(f x))))
  ; (define two (add-1 one))
  ; (define two (add-1 (lambda (f) (lambda (x) (f x)))))
  (define two
    (lambda (f)
      (lambda (x)
	; (f (((lambda (f) (lambda (x) (f x))) f) x)))))
	(f (f x)))))

  ;; (define (add n1 n2) ((n1 add-1) ((n2 add-1) zero)))
  (define (add n1 n2)
    (lambda (f)
      (lambda (x)
	((n1 f) ((n2 f) x)))))

  (define three (add two one))
  ;; (((lambda (f) (lambda (x) (f (f x)))) add-1)  (((lambda (f) (lambda (x) (f x))) add-1) zero))
  ;; ((lambda (x) (add-1 (add-1 x)))
  ;;  ((lambda (x) (add-1 x)) zero))
  ;; ((lambda (x) (add-1 (add-1 x)))
  ;;  (add-1 zero))
  ;; ((add-1 (add-1 (add-1 zero))))

  (define (twice n) (add n n))
  (define n5 (add three two))
  (define n20 (twice (twice n5)))
  (define n80 (twice (twice n20)))
  (define n320 (twice (twice n80)))
  (define n400 (add n320 n80))
  (define n420 (add n400 n20))
  ((n420 inc) 0)
#+end_src

#+RESULTS[6ff32f5839d6d73fb38de84190b8d4dbe6b402b9]:
: 420

*** 2.1.4 Extended Exercise: Interval Arithmetic

