s2.1-introduction-to-data-abstraction.org
**** Introduce interval arithmetic
...ability to manipulate inexact quantities with known precision, so that when a computation is done with such approximate quantities result is a number with known precision.

Compute the value of a parallel equivalent resistence $R_p$ of two resistors $R_1$ and $R_2$:
$$ R_p = \frac{1}{1/R_1 + 1/R_2} $$

#+name: interval-arithmetic-example
#+begin_src maxima
  R_1: 6.8;
  R_1_tol: 0.1;
  R_1_min: R_1*(1-R_1_tol);
  R_1_max: R_1*(1+R_1_tol);

  R_2: 4.7;
  R_2_tol: 0.05;
  R_2_min: R_2*(1-R_2_tol);
  R_2_max: R_2*(1+R_2_tol);

  display(R_1_min, R_1_max);
  display(R_2_min, R_2_max);

  R_p(r1, r2) := 1/(1/r1 + 1/r2);

  R_p_min: R_p(R_1_min, R_2_min);
  R_p_max: R_p(R_1_max, R_2_max);
  display(R_p_min, R_p_max);
#+end_src

#+RESULTS[e5203b46d9a931f99a13a8c7ae30c7c383d22579]: interval-arithmetic-example
| R_1_min | = |              6.12 |
| R_1_max | = |              7.48 |
| R_2_min | = |             4.465 |
| R_2_max | = |             4.935 |
| R_p_min | = | 2.581558809636278 |
| R_p_max | = |  2.97332259363673 |

#+RESULTS[e5203b46d9a931f99a13a8c7ae30c7c383d22579]:
| R_1_min | = |              6.12 |
| R_1_max | = |              7.48 |
| R_2_min | = |             4.465 |
| R_2_max | = |             4.935 |
| R_p_min | = | 2.581558809636278 |
| R_p_max | = |  2.97332259363673 |

Idea is to implement "interval arithmetic" as a set of arithmetic operations for combining "intervals". The result of adding, subtracting, multiplyting and dividing two intervals is itself an interval, representing the range of results.

Accept as a postulate the existence of an abstract object called an "interval" that has two endpoints: a lower bound and an upper bound. ~make-interval~ can be used to construct the interval given two endpoints.

**** Some operations implementation

Add, multiply and divide operations:
#+name: interval-operations-abstract
#+begin_src racket :exports code
  (define (add-interval x y)
    (make-interval (+ (lower-bound x) (lower-bound y))
		   (+ (upper-bound x) (upper-bound y))))

  (define (mul-interval x y)
    (let ((p1 (* (lower-bound x) (lower-bound y)))
	  (p2 (* (lower-bound x) (upper-bound y)))
	  (p3 (* (upper-bound x) (lower-bound y)))
	  (p4 (* (upper-bound x) (upper-bound y))))
      (make-interval (min p1 p2 p3 p4)
		     (max p1 p2 p3 p4))))

  (define (div-interval x y)
    (if (and (<= (lower-bound y) 0)
	     (>= (upper-bound y) 0))
	(error "Undefined division by interval containing 0 -- div-interval" y)
	(mul-interval x
		      (make-interval (/ 1.0 (upper-bound y))
				     (/ 1.0 (lower-bound y))))))

#+end_src

#+RESULTS[fcf3637006a1a3c0d07da725e73c6a4da9c64259]: interval-operations-abstract
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-LX7iYb/ob-racketZouGCX.rkt:4:3: make-interval: unbound identifier
:   in: make-interval
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-LX7iYb/ob-racketZouGCX.rkt:4:3

**** Exercise 2.7 - Constructor and selectors

#+name: interval-constructor
#+begin_src racket
  (define (make-interval a b) (cons a b))

#+end_src

#+RESULTS[fbbff3b4fe7fc016e979d6b5950c8aa5db020a77]: interval-constructor

#+name: interval-selectors
#+begin_src racket
  (define (lower-bound i) (car i))
  (define (upper-bound i) (cdr i))

#+end_src

#+RESULTS[e4340c797f7925f1f4417c201193b8dbd33b391d]: interval-selectors

And let's see what we've got already:
#+name: interval-ex2.7-test
#+begin_src racket :cache yes :noweb yes
  #lang sicp
  <<interval-constructor>>
  <<interval-selectors>>
  <<interval-operations-abstract>>

  (define i1 (make-interval 1.5 2.5))
  (define i2 (make-interval 0.1 0.3))
  (add-interval i1 i2)
  (mul-interval i1 i2)
  (div-interval i1 i2)
  (div-interval i2 i1)
#+end_src

#+RESULTS[dc3b0fe14eae73b5e0b6fbe7776e3ff4e887aa81]: interval-ex2.7-test
: (1.6 . 2.8)
: (0.15000000000000002 . 0.75)
: (5.0 . 25.0)
: (0.04000000000000001 . 0.19999999999999998)

**** Exercise 2.8 - Difference of intervals

Lower bound of the difference of two intervals is the difference between the lower bound of the minuend and the upper bound of the subtrahend.
Upper bound of the difference of two intervals is the difference between the upper bound of the minuend and the lower bound of the subtrahend.

#+name: interval-interface-1-snippet
#+begin_src racket :noweb yes
  <<interval-constructor>>
  <<interval-selectors>>
  <<interval-operations-abstract>>  
  (define (sub-interval x y)
    (make-interval (- (lower-bound x) (upper-bound y))
		   (- (upper-bound x) (lower-bound y))))
#+end_src

#+RESULTS[ec1a50f2e439fdde6fadee5a15e79fc5734f1c38]: interval-interface-1-snippet

And see how it looks like:
#+name: ex-2.8-test
#+begin_src racket :noweb yes
  #lang sicp

  <<interval-interface-1-snippet>>
  (define i1 (make-interval 1.5 2.5))
  (define i2 (make-interval 0.1 0.3))
  (sub-interval i1 i2)
  (sub-interval i2 i1)
#+end_src

#+RESULTS[49d01245a86a986d7c647cccfb2e814053de869c]: ex-2.8-test
: (1.2 . 2.4)
: (-2.4 . -1.2)

#+RESULTS[49d01245a86a986d7c647cccfb2e814053de869c]:
: (1.2 . 2.4)
: (-2.4 . -1.2)

