s2.1-introduction-to-data-abstraction.html
<div id="outline-container-orgd129157" class="outline-4">
<h4 id="orgd129157">Introduce interval arithmetic</h4>
<div class="outline-text-4" id="text-orgd129157">
<p>
&#x2026;ability to manipulate inexact quantities with known precision, so that when a computation is done with such approximate quantities result is a number with known precision.
</p>

<p>
Compute the value of a parallel equivalent resistence \(R_p\) of two resistors \(R_1\) and \(R_2\):
\[ R_p = \frac{1}{1/R_1 + 1/R_2} \]
</p>

<div class="org-src-container">
<pre class="src src-maxima" id="org8cf2e0a">R_1: 6.8;
R_1_tol: 0.1;
R_1_min: R_1*(1-R_1_tol);
R_1_max: R_1*(1+R_1_tol);

R_2: 4.7;
R_2_tol: 0.05;
R_2_min: R_2*(1-R_2_tol);
R_2_max: R_2*(1+R_2_tol);

display(R_1_min, R_1_max);
display(R_2_min, R_2_max);

R_p(r1, r2) := 1/(1/r1 + 1/r2);

R_p_min: R_p(R_1_min, R_2_min);
R_p_max: R_p(R_1_max, R_2_max);
display(R_p_min, R_p_max);
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">R<sub>1</sub><sub>min</sub></td>
<td class="org-left">=</td>
<td class="org-right">6.12</td>
</tr>

<tr>
<td class="org-left">R<sub>1</sub><sub>max</sub></td>
<td class="org-left">=</td>
<td class="org-right">7.48</td>
</tr>

<tr>
<td class="org-left">R<sub>2</sub><sub>min</sub></td>
<td class="org-left">=</td>
<td class="org-right">4.465</td>
</tr>

<tr>
<td class="org-left">R<sub>2</sub><sub>max</sub></td>
<td class="org-left">=</td>
<td class="org-right">4.935</td>
</tr>

<tr>
<td class="org-left">R<sub>p</sub><sub>min</sub></td>
<td class="org-left">=</td>
<td class="org-right">2.581558809636278</td>
</tr>

<tr>
<td class="org-left">R<sub>p</sub><sub>max</sub></td>
<td class="org-left">=</td>
<td class="org-right">2.97332259363673</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">R<sub>1</sub><sub>min</sub></td>
<td class="org-left">=</td>
<td class="org-right">6.12</td>
</tr>

<tr>
<td class="org-left">R<sub>1</sub><sub>max</sub></td>
<td class="org-left">=</td>
<td class="org-right">7.48</td>
</tr>

<tr>
<td class="org-left">R<sub>2</sub><sub>min</sub></td>
<td class="org-left">=</td>
<td class="org-right">4.465</td>
</tr>

<tr>
<td class="org-left">R<sub>2</sub><sub>max</sub></td>
<td class="org-left">=</td>
<td class="org-right">4.935</td>
</tr>

<tr>
<td class="org-left">R<sub>p</sub><sub>min</sub></td>
<td class="org-left">=</td>
<td class="org-right">2.581558809636278</td>
</tr>

<tr>
<td class="org-left">R<sub>p</sub><sub>max</sub></td>
<td class="org-left">=</td>
<td class="org-right">2.97332259363673</td>
</tr>
</tbody>
</table>

<p>
Idea is to implement "interval arithmetic" as a set of arithmetic operations for combining "intervals". The result of adding, subtracting, multiplyting and dividing two intervals is itself an interval, representing the range of results.
</p>

<p>
Accept as a postulate the existence of an abstract object called an "interval" that has two endpoints: a lower bound and an upper bound. <code>make-interval</code> can be used to construct the interval given two endpoints.
</p>
</div>
</div>

<div id="outline-container-orgc3601c2" class="outline-4">
<h4 id="orgc3601c2">Some operations implementation</h4>
<div class="outline-text-4" id="text-orgc3601c2">
<p>
Add, multiply and divide operations:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org8e54c9d">(define (add-interval x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
		 (+ (upper-bound x) (upper-bound y))))

(define (mul-interval x y)
  (let ((p1 (* (lower-bound x) (lower-bound y)))
	(p2 (* (lower-bound x) (upper-bound y)))
	(p3 (* (upper-bound x) (lower-bound y)))
	(p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
		   (max p1 p2 p3 p4))))

(define (div-interval x y)
  (if (and (&lt;= (lower-bound y) 0)
	   (&gt;= (upper-bound y) 0))
      (error "Undefined division by interval containing 0 -- div-interval" y)
      (mul-interval x
		    (make-interval (/ 1.0 (upper-bound y))
				   (/ 1.0 (lower-bound y))))))

</pre>
</div>
</div>
</div>

<div id="outline-container-orga9b62b3" class="outline-4">
<h4 id="orga9b62b3">Exercise 2.7 - Constructor and selectors</h4>
<div class="outline-text-4" id="text-orga9b62b3">
<div class="org-src-container">
<pre class="src src-racket" id="org58cc720">(define (make-interval a b) (cons a b))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket" id="org5b7b046">(define (lower-bound i) (car i))
(define (upper-bound i) (cdr i))

</pre>
</div>

<p>
And let's see what we've got already:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org57a8aa0">#lang sicp
(define (make-interval a b) (cons a b))

(define (lower-bound i) (car i))
(define (upper-bound i) (cdr i))

(define (add-interval x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
		 (+ (upper-bound x) (upper-bound y))))

(define (mul-interval x y)
  (let ((p1 (* (lower-bound x) (lower-bound y)))
	(p2 (* (lower-bound x) (upper-bound y)))
	(p3 (* (upper-bound x) (lower-bound y)))
	(p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
		   (max p1 p2 p3 p4))))

(define (div-interval x y)
  (if (and (&lt;= (lower-bound y) 0)
	   (&gt;= (upper-bound y) 0))
      (error "Undefined division by interval containing 0 -- div-interval" y)
      (mul-interval x
		    (make-interval (/ 1.0 (upper-bound y))
				   (/ 1.0 (lower-bound y))))))


(define i1 (make-interval 1.5 2.5))
(define i2 (make-interval 0.1 0.3))
(add-interval i1 i2)
(mul-interval i1 i2)
(div-interval i1 i2)
(div-interval i2 i1)
</pre>
</div>

<pre class="example">
(1.6 . 2.8)
(0.15000000000000002 . 0.75)
(5.0 . 25.0)
(0.04000000000000001 . 0.19999999999999998)
</pre>
</div>
</div>

<div id="outline-container-org58f3bbb" class="outline-4">
<h4 id="org58f3bbb">Exercise 2.8 - Difference of intervals</h4>
<div class="outline-text-4" id="text-org58f3bbb">
<p>
Lower bound of the difference of two intervals is the difference between the lower bound of the minuend and the upper bound of the subtrahend.
Upper bound of the difference of two intervals is the difference between the upper bound of the minuend and the lower bound of the subtrahend.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org6b15f76">(define (make-interval a b) (cons a b))

(define (lower-bound i) (car i))
(define (upper-bound i) (cdr i))

(define (add-interval x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
		 (+ (upper-bound x) (upper-bound y))))

(define (mul-interval x y)
  (let ((p1 (* (lower-bound x) (lower-bound y)))
	(p2 (* (lower-bound x) (upper-bound y)))
	(p3 (* (upper-bound x) (lower-bound y)))
	(p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
		   (max p1 p2 p3 p4))))

(define (div-interval x y)
  (if (and (&lt;= (lower-bound y) 0)
	   (&gt;= (upper-bound y) 0))
      (error "Undefined division by interval containing 0 -- div-interval" y)
      (mul-interval x
		    (make-interval (/ 1.0 (upper-bound y))
				   (/ 1.0 (lower-bound y))))))

(define (sub-interval x y)
  (make-interval (- (lower-bound x) (upper-bound y))
		 (- (upper-bound x) (lower-bound y))))
</pre>
</div>

<p>
And see how it looks like:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org76273bb">#lang sicp

(define (make-interval a b) (cons a b))

(define (lower-bound i) (car i))
(define (upper-bound i) (cdr i))

(define (add-interval x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
		 (+ (upper-bound x) (upper-bound y))))

(define (mul-interval x y)
  (let ((p1 (* (lower-bound x) (lower-bound y)))
	(p2 (* (lower-bound x) (upper-bound y)))
	(p3 (* (upper-bound x) (lower-bound y)))
	(p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
		   (max p1 p2 p3 p4))))

(define (div-interval x y)
  (if (and (&lt;= (lower-bound y) 0)
	   (&gt;= (upper-bound y) 0))
      (error "Undefined division by interval containing 0 -- div-interval" y)
      (mul-interval x
		    (make-interval (/ 1.0 (upper-bound y))
				   (/ 1.0 (lower-bound y))))))

(define (sub-interval x y)
  (make-interval (- (lower-bound x) (upper-bound y))
		 (- (upper-bound x) (lower-bound y))))
(define i1 (make-interval 1.5 2.5))
(define i2 (make-interval 0.1 0.3))
(sub-interval i1 i2)
(sub-interval i2 i1)
</pre>
</div>

<pre class="example">
(1.2 . 2.4)
(-2.4 . -1.2)
</pre>


<pre class="example">
(1.2 . 2.4)
(-2.4 . -1.2)
</pre>
</div>
</div>
