s2.1-introduction-to-data-abstraction.org
**** Exercise 2.9 - The width of an interval
The /width/ of an interval is half of the difference between its upper and lower bounds. The width is a measure of uncertainty of the number specified by the interval. For some arithmetic operations the width of the result of combining two intervals is a function only of the widths of the argument intervals, whereas for others the width of the combination is not a function of the width of the argument intervals.

1. Show that the width of the sum (or difference) of two intervals depends only on the widths of term intervals added (or subtracted).
   - This shows that width of the sum is a function of widths of term intervals:
     $$ I_1 = [x_l, x_u], w_1 = \frac{x_u-x_l}{2} $$
     $$ I_2 = [y_l, y_u], w_2 = \frac{y_u-y_l}{2} $$
     $$ I_s = I_1 + I_2 = [x_l + y_l, x_u + y_u] $$
     $$ w_s = \frac{x_u+y_u-x_l-y_l}{2} = \frac{x_u-x_l}{2} + \frac{y_u-y_l}{2} = w_1 + w_2 $$

   - Similar reasoning can be applied to show that the width of the difference is a function of the widths of term intervals.

2. Give examles to show that this is not true for multiplication (or division).
   - Consider this example:
     $$ I_1 = [-1, 1], w_1 = \frac{2}{2} = 1 $$
     $$ I_2 = [-3, 2], w_2 = \frac{5}{2} $$
     $$ I_m = I_1 \times I_2 = [-1, 1] \times [-3, 2] = [1 * -3, -1 * -3] = [-3, 3] $$
     $$ w_m = \frac{6}{2} = 3 $$
     
     $$ J_1 = [1, 3], v_1 = \frac{2}{2} = 1 $$
     $$ J_2 = [0, 5], v_2 = \frac{5}{2} $$
     $$ J_m = J_1 \times J_2 = [1, 3] \times [0, 5] = [0 * 1, 5 * 3] = [0, 15] $$
     $$ v_m = \frac{15}{2}$$
   - The pair of intervals $(I_1, I_2)$ has the same widths as the pair $(J_1, J_2)$, but the width of respective products differ, and so can not be a function of widths of term intervals


**** Exercise 2.10 - Divide by interval spanning zero
It is not clear what it means to divide by an interval that spans zero. Modify code to check for this condition and to signal error if it occurs.

#+name: ex2.10-updated-div-interval
#+begin_src racket
  (define (div-interval x y)
    (if (and (<= (lower-bound y) 0)
	     (>= (upper-bound y) 0))
	(error "Undefined division by interval containing 0 -- div-interval" y)
	(mul-interval x
		      (make-interval (/ 1.0 (upper-bound y))
				     (/ 1.0 (lower-bound y))))))
#+end_src

#+RESULTS[4f20cf959d99b212d5c6cb7d413ab047b86ecf9e]: ex2.10-updated-div-interval
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-Vtoyle/ob-racket34STtA.rkt:4:16: lower-bound: unbound identifier
:   in: lower-bound
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-Vtoyle/ob-racket34STtA.rkt:4:16

See how it works:
#+name: ex2.10-test
#+begin_src racket :noweb strip-export
  #lang sicp

  <<interval-interface-1-snippet>>

  (define j1 (make-interval 1 2))
  (define j2 (make-interval 1 2))
  (div-interval j1 j2)

  (define i1 (make-interval 1 2))
  (define i2 (make-interval -1 2))
  (div-interval i1 i2)

#+end_src

#+RESULTS[4bccf3ab4a68bc6ef9a76da0765e8385965fa97e]: ex2.10-test
: Undefined division by interval containing 0 -- div-interval (-1 . 2)
:   context...:
:    body of "/var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-gqTov2/ob-racketgF8jkY.rkt"
: (0.5 . 2.0)


**** Exercise 2.11 - Optimize ~mul-interval~

By test the signs of the endpoints of the intervals, it is possible to break ~mul-interval~ into nine cases, only one of which requires more than two multiplications.

#+name: interval-mul-optimized
#+begin_src racket
  (define (mul-interval-optimized x y)
    (define (neg? a) (< a 0))
    (define (non-neg? a) (>= a 0))
    (let ((xl (lower-bound x))
	  (xu (upper-bound x))
	  (yl (lower-bound y))
	  (yu (upper-bound y)))
      (cond ((neg? xu)
	     (cond ((neg? yu)
		    (make-interval (* xu yu) (* xl yl)))
		   ((and (neg? yl) (non-neg? yu))
		    (make-interval (* xl yu) (* xl yl)))
		   ((non-neg? yu)
		    (make-interval (* xl yu) (* xu yl)))))
	    ((and (neg? xl) (non-neg? xu))
	     (cond ((neg? yu)
		    (make-interval (* xu yl) (* xl yl)))
		   ((and (neg? yl) (non-neg? yu))
		    (let ((l1 (* xl yu))
			  (l2 (* xu yl))
			  (u1 (* xl yl))
			  (u2 (* xu yu)))
		      (make-interval (if (< l1 l2) l1 l2)
				     (if (> u1 u2) u1 u2))))
		   ((non-neg? yu)
		    (make-interval (* xl yu)
				   (* xu yu)))))
	    ((non-neg? xl)
	     (cond ((neg? yu)
		    (make-interval (* xu yl)
				   (* xl yu)))
		   ((and (neg? yl) (non-neg? yu))
		    (make-interval (* xu yl)
				   (* xu yu)))
		   ((non-neg? yu)
		    (make-interval (* xl yl) (* xu yu))))))))
#+end_src

#+RESULTS[4ffe309780b1fea2fec4a3282f909382d9aa81cd]: interval-mul-optimized
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-7EYdr2/ob-racket3nqFaj.rkt:6:13: lower-bound: unbound identifier
:   in: lower-bound
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-7EYdr2/ob-racket3nqFaj.rkt:6:13

Validate compared to the simple method:
#+name: ex-2.11-test
#+begin_src racket :noweb strip-export
  #lang sicp
  <<interval-interface-1-snippet>>
  <<interval-mul-optimized>>
  (define (equal-interval? x y) (and (= (lower-bound x) (lower-bound y))
				     (= (upper-bound x) (upper-bound y))))

  (define (test i1 i2)
    (let ((expected (mul-interval i1 i2))
	  (actual (mul-interval-optimized i1 i2)))
      (if (not (equal-interval? actual expected))
	  (list "fail" i1 i2 "expected:" expected "actual:" actual)
	  "pass")))

  (test (make-interval -3 -2) (make-interval -5 -4))
  (test (make-interval -3 -2) (make-interval -5 4))
  (test (make-interval -3 -2) (make-interval 4 5))

  (test (make-interval -3 2) (make-interval -5 -4))
  (test (make-interval -3 2) (make-interval -5 4))
  (test (make-interval -3 10) (make-interval -5 12))
  (test (make-interval -3 2) (make-interval 4 5))

  (test (make-interval 2 3) (make-interval -5 -4))
  (test (make-interval 2 3) (make-interval -5 4))
  (test (make-interval 2 3) (make-interval 4 5))
#+end_src

#+RESULTS[31c18114cc3267c07e0ba6bbd58612d7e895ff25]: ex-2.11-test
#+begin_example
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
#+end_example


**** Alternate constructors
Program should with numbers represented as a center value and an additive tolerance, e.g. $3.5 \pm 0.15$, not $[3.35, 3.65]$.

#+name: interval-interface-center-width
#+begin_src racket :exports code
  (define (make-center-width c w)
    (make-interval (- c w) (+ c w)))

  (define (center i)
    (/ (+ (lower-bound i) (upper-bound i)) 2))

  (define (width i)
    (/ (- (upper-bound i) (lower-bound i)) 2))
#+end_src

#+RESULTS[89c8c23701b0a424d51cb823a15857cfb26135bb]: interval-interface-center-width
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-3AlohL/ob-racketnedPUO.rkt:4:3: make-interval: unbound identifier
:   in: make-interval
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-3AlohL/ob-racketnedPUO.rkt:4:3

