s2.1-introduction-to-data-abstraction.html

<div id="outline-container-org8ed40ba" class="outline-4">
<h4 id="org8ed40ba">Exercise 2.9 - The width of an interval</h4>
<div class="outline-text-4" id="text-org8ed40ba">
<p>
The <i>width</i> of an interval is half of the difference between its upper and lower bounds. The width is a measure of uncertainty of the number specified by the interval. For some arithmetic operations the width of the result of combining two intervals is a function only of the widths of the argument intervals, whereas for others the width of the combination is not a function of the width of the argument intervals.
</p>

<ol class="org-ol">
<li>Show that the width of the sum (or difference) of two intervals depends only on the widths of term intervals added (or subtracted).
<ul class="org-ul">
<li>This shows that width of the sum is a function of widths of term intervals:
\[ I_1 = [x_l, x_u], w_1 = \frac{x_u-x_l}{2} \]
\[ I_2 = [y_l, y_u], w_2 = \frac{y_u-y_l}{2} \]
\[ I_s = I_1 + I_2 = [x_l + y_l, x_u + y_u] \]
\[ w_s = \frac{x_u+y_u-x_l-y_l}{2} = \frac{x_u-x_l}{2} + \frac{y_u-y_l}{2} = w_1 + w_2 \]</li>

<li>Similar reasoning can be applied to show that the width of the difference is a function of the widths of term intervals.</li>
</ul></li>

<li>Give examles to show that this is not true for multiplication (or division).
<ul class="org-ul">
<li><p>
Consider this example:
\[ I_1 = [-1, 1], w_1 = \frac{2}{2} = 1 \]
\[ I_2 = [-3, 2], w_2 = \frac{5}{2} \]
\[ I_m = I_1 \times I_2 = [-1, 1] \times [-3, 2] = [1 * -3, -1 * -3] = [-3, 3] \]
\[ w_m = \frac{6}{2} = 3 \]
</p>

<p>
\[ J_1 = [1, 3], v_1 = \frac{2}{2} = 1 \]
\[ J_2 = [0, 5], v_2 = \frac{5}{2} \]
\[ J_m = J_1 \times J_2 = [1, 3] \times [0, 5] = [0 * 1, 5 * 3] = [0, 15] \]
\[ v_m = \frac{15}{2}\]
</p></li>
<li>The pair of intervals \((I_1, I_2)\) has the same widths as the pair \((J_1, J_2)\), but the width of respective products differ, and so can not be a function of widths of term intervals</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-org06ddeb9" class="outline-4">
<h4 id="org06ddeb9">Exercise 2.10 - Divide by interval spanning zero</h4>
<div class="outline-text-4" id="text-org06ddeb9">
<p>
It is not clear what it means to divide by an interval that spans zero. Modify code to check for this condition and to signal error if it occurs.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orga377798">(define (div-interval x y)
  (if (and (&lt;= (lower-bound y) 0)
	   (&gt;= (upper-bound y) 0))
      (error "Undefined division by interval containing 0 -- div-interval" y)
      (mul-interval x
		    (make-interval (/ 1.0 (upper-bound y))
				   (/ 1.0 (lower-bound y))))))
</pre>
</div>

<pre class="example">
/var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-Vtoyle/ob-racket34STtA.rkt:4:16: lower-bound: unbound identifier
  in: lower-bound
  location...:
   /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-Vtoyle/ob-racket34STtA.rkt:4:16
</pre>


<p>
See how it works:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org5035a52">#lang sicp



(define j1 (make-interval 1 2))
(define j2 (make-interval 1 2))
(div-interval j1 j2)

(define i1 (make-interval 1 2))
(define i2 (make-interval -1 2))
(div-interval i1 i2)

</pre>
</div>

<pre class="example">
Undefined division by interval containing 0 -- div-interval (-1 . 2)
  context...:
   body of "/var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-gqTov2/ob-racketgF8jkY.rkt"
(0.5 . 2.0)
</pre>
</div>
</div>


<div id="outline-container-org72a18db" class="outline-4">
<h4 id="org72a18db">Exercise 2.11 - Optimize <code>mul-interval</code></h4>
<div class="outline-text-4" id="text-org72a18db">
<p>
By test the signs of the endpoints of the intervals, it is possible to break <code>mul-interval</code> into nine cases, only one of which requires more than two multiplications.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org824ff48">(define (mul-interval-optimized x y)
  (define (neg? a) (&lt; a 0))
  (define (non-neg? a) (&gt;= a 0))
  (let ((xl (lower-bound x))
	(xu (upper-bound x))
	(yl (lower-bound y))
	(yu (upper-bound y)))
    (cond ((neg? xu)
	   (cond ((neg? yu)
		  (make-interval (* xu yu) (* xl yl)))
		 ((and (neg? yl) (non-neg? yu))
		  (make-interval (* xl yu) (* xl yl)))
		 ((non-neg? yu)
		  (make-interval (* xl yu) (* xu yl)))))
	  ((and (neg? xl) (non-neg? xu))
	   (cond ((neg? yu)
		  (make-interval (* xu yl) (* xl yl)))
		 ((and (neg? yl) (non-neg? yu))
		  (let ((l1 (* xl yu))
			(l2 (* xu yl))
			(u1 (* xl yl))
			(u2 (* xu yu)))
		    (make-interval (if (&lt; l1 l2) l1 l2)
				   (if (&gt; u1 u2) u1 u2))))
		 ((non-neg? yu)
		  (make-interval (* xl yu)
				 (* xu yu)))))
	  ((non-neg? xl)
	   (cond ((neg? yu)
		  (make-interval (* xu yl)
				 (* xl yu)))
		 ((and (neg? yl) (non-neg? yu))
		  (make-interval (* xu yl)
				 (* xu yu)))
		 ((non-neg? yu)
		  (make-interval (* xl yl) (* xu yu))))))))
</pre>
</div>

<pre class="example">
/var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-7EYdr2/ob-racket3nqFaj.rkt:6:13: lower-bound: unbound identifier
  in: lower-bound
  location...:
   /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-7EYdr2/ob-racket3nqFaj.rkt:6:13
</pre>


<p>
Validate compared to the simple method:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="org5cbbd36">#lang sicp


(define (equal-interval? x y) (and (= (lower-bound x) (lower-bound y))
				   (= (upper-bound x) (upper-bound y))))

(define (test i1 i2)
  (let ((expected (mul-interval i1 i2))
	(actual (mul-interval-optimized i1 i2)))
    (if (not (equal-interval? actual expected))
	(list "fail" i1 i2 "expected:" expected "actual:" actual)
	"pass")))

(test (make-interval -3 -2) (make-interval -5 -4))
(test (make-interval -3 -2) (make-interval -5 4))
(test (make-interval -3 -2) (make-interval 4 5))

(test (make-interval -3 2) (make-interval -5 -4))
(test (make-interval -3 2) (make-interval -5 4))
(test (make-interval -3 10) (make-interval -5 12))
(test (make-interval -3 2) (make-interval 4 5))

(test (make-interval 2 3) (make-interval -5 -4))
(test (make-interval 2 3) (make-interval -5 4))
(test (make-interval 2 3) (make-interval 4 5))
</pre>
</div>

<pre class="example" id="org83cd7ea">
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
"pass"
</pre>
</div>
</div>


<div id="outline-container-orgd7cfa66" class="outline-4">
<h4 id="orgd7cfa66">Alternate constructors</h4>
<div class="outline-text-4" id="text-orgd7cfa66">
<p>
Program should with numbers represented as a center value and an additive tolerance, e.g. \(3.5 \pm 0.15\), not \([3.35, 3.65]\).
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org337aa73">(define (make-center-width c w)
  (make-interval (- c w) (+ c w)))

(define (center i)
  (/ (+ (lower-bound i) (upper-bound i)) 2))

(define (width i)
  (/ (- (upper-bound i) (lower-bound i)) 2))
</pre>
</div>
</div>
</div>
