s2.1-introduction-to-data-abstraction.org
**** Exercise 2.12 - Center-percentage interface
Define a constructor ~make-center-percent~ that takes a center and a percentage tolerance and produces the desired interval.
Also define ~percent~ selector.

#+name: interval-interface-center-percent
#+begin_src racket :exports code
  (define (make-center-percent c p)
    (let ((w (* c p 0.01)))
      (make-interval (- c w) (+ c w))))

  (define (center i)
    (/ (+ (lower-bound i) (upper-bound i)) 2))

  (define (width i)
    (/ (- (upper-bound i) (lower-bound i)) 2))

  (define (percent i)
    (* 100 (width i) (/ 1 (center i))))
#+end_src

#+RESULTS[891c04878ff63339a43ec7754878b64f7195611e]: interval-interface-center-percent
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-zZnb4T/ob-racket0rcICj.rkt:5:5: make-interval: unbound identifier
:   in: make-interval
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-zZnb4T/ob-racket0rcICj.rkt:5:5

#+name: ex2.12-test
#+begin_src racket :noweb strip-export
  #lang sicp
  <<interval-interface-1-snippet>>
  <<interval-interface-center-percent>>
  (define i (make-center-percent 6.8 10))
  (center i)
  (percent i)
  (width i)
  i
#+end_src

#+RESULTS[0aaa22761bc5a995d04fb431fa7f65483b3f0e70]: ex2.12-test
: 6.8
: 9.999999999999996
: 0.6799999999999997
: (6.12 . 7.4799999999999995)

**** Exercise 2.13 - Approximate product tolerance when percentages are small

Assume all bounds are positive numbers, for simplicity.

Consider the product of two intervals $a \pm p$ and $b \pm q$.

Their corresponding interval representation is $[a(1-p), a(1+p)]$ and $[b(1-q), b(1+q)]$.

As all bounds are assumed to be positive numbers, we can readily find the bounds of the product: $$[ab(1-p)(1-q), ab(1+p)(1+q)] = [ab(1 - (p+q) + pq), ab(1 + (p+q) + pq)$$

If $p$ and $q$ are small, $pq$ is very small, we can neglect it for the approximation, and then $$(a \pm p) \times (b \pm q) \approx (ab \pm (p+q))$$

**** Different results for algebraically equivalent expressions

#+name: alternate-expression-complaint-demo
#+begin_src racket :exports code
  (define (par1 r1 r2)
    (div-interval (mul-interval r1 r2)
		  (add-interval r1 r2)))

  (define (par2 r1 r2)
    (let ((one (make-interval 1 1)))
      (div-interval one
		    (add-interval (div-interval one r1)
				  (div-interval one r2)))))
#+end_src

#+RESULTS[92376e3a1e961d4cb2dfce1bc6c11adac105c80f]: alternate-expression-complaint-demo
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-n8i7M1/ob-racketicUXmI.rkt:4:3: div-interval: unbound identifier
:   in: div-interval
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-n8i7M1/ob-racketicUXmI.rkt:4:3

**** TODO Exercise 2.14 - Demonstrate the bug
#+name: ex-2.14-demo
#+begin_src racket :noweb strip-export
  #lang sicp
  <<interval-interface-1-snippet>>
  <<interval-interface-center-percent>>

  <<alternate-expression-complaint-demo>>
  (define (display-center-percent i)
    (define (round2 x) (/ (round (* 1000 x)) 1000))
    (display (round2 (center i)))
    (display " ± ")
    (display (round2 (percent i)))
    (newline))

  (define i1 (make-center-percent 6.8 10))
  (define i2 (make-center-percent 6.8 7.5))
  (define i3 (make-center-percent 6.8 4))
  (define i4 (make-center-percent 6.8 2))

  (define i5 (make-center-percent 4.7 5))

  (newline)
  (display "div by self:") (newline)
  (display-center-percent (div-interval i1 i1))
  (display-center-percent (div-interval i2 i2))
  (display-center-percent (div-interval i3 i3))
  (display-center-percent (div-interval i4 i4))

  (newline)
  (display "mul by self:") (newline)
  (display-center-percent (mul-interval i1 i1))
  (display-center-percent (mul-interval i2 i2))
  (display-center-percent (mul-interval i3 i3))
  (display-center-percent (mul-interval i4 i4))

  (newline)
  (display "div by same:") (newline)
  (display-center-percent (div-interval i1 i5))
  (display-center-percent (div-interval i2 i5))
  (display-center-percent (div-interval i3 i5))
  (display-center-percent (div-interval i4 i5))

  (newline)
  (display "same divided:") (newline)
  (display-center-percent (div-interval i5 i1))
  (display-center-percent (div-interval i5 i2))
  (display-center-percent (div-interval i5 i3))
  (display-center-percent (div-interval i5 i4))

  (newline) (display "-------------------") (newline)


  (display "r1: ") (display-center-percent i4)
  (display "r2: ") (display-center-percent i5)

  (newline)
  (display "step-by-step par1") (newline)
  (display "mul: ") (display-center-percent (mul-interval i4 i5))
  (display "add: ") (display-center-percent (add-interval i4 i5))
  (display "div: ") (display-center-percent (par1 i4 i5))

  (newline)
  (display "step-by-step par2") (newline)
  (display "rec1: ") (display-center-percent (div-interval (make-interval 1 1) i4))
  (display "rec2: ") (display-center-percent (div-interval (make-interval 1 1) i5))
  (display "add: ") (display-center-percent (add-interval (div-interval (make-interval 1 1) i4)
							  (div-interval (make-interval 1 1) i5)))
  (display "rec: ") (display-center-percent (par2 i4 i5))

  (newline)
  (display "par examples:") (newline)
  (display-center-percent (par1 i4 i5))
  (display-center-percent (par2 i4 i5))


#+end_src

#+RESULTS[a95b35d7cfc264979f7dd93d85caf81bc31c96ff]: ex-2.14-demo
#+begin_example

div by self:
1.02 ± 19.802
1.011 ± 14.916
1.003 ± 7.987
1.001 ± 3.998

mul by self:
46.702 ± 19.802
46.5 ± 14.916
46.314 ± 7.987
46.258 ± 3.998

div by same:
1.458 ± 14.925
1.456 ± 12.453
1.453 ± 8.982
1.452 ± 6.993

same divided:
0.702 ± 14.925
0.698 ± 12.453
0.694 ± 8.982
0.692 ± 6.993

-------------------
r1: 6.8 ± 2.0
r2: 4.7 ± 5.0

step-by-step par1
mul: 31.992 ± 6.993
add: 11.5 ± 3.226
div: 2.791 ± 10.196

step-by-step par2
rec1: 0.147 ± 2.0
rec2: 0.213 ± 5.0
add: 0.36 ± 3.775
rec: 2.779 ± 3.775

par examples:
2.791 ± 10.196
2.779 ± 3.775
#+end_example

**** TODO Exercise 2.15
**** TODO Exercise 2.16
