s2.1-introduction-to-data-abstraction.html

<div id="outline-container-orgfba6247" class="outline-4">
<h4 id="orgfba6247">Exercise 2.12 - Center-percentage interface</h4>
<div class="outline-text-4" id="text-orgfba6247">
<p>
Define a constructor <code>make-center-percent</code> that takes a center and a percentage tolerance and produces the desired interval.
Also define <code>percent</code> selector.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgf50c14e">(define (make-center-percent c p)
  (let ((w (* c p 0.01)))
    (make-interval (- c w) (+ c w))))

(define (center i)
  (/ (+ (lower-bound i) (upper-bound i)) 2))

(define (width i)
  (/ (- (upper-bound i) (lower-bound i)) 2))

(define (percent i)
  (* 100 (width i) (/ 1 (center i))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket" id="orga4d17a2">#lang sicp


(define i (make-center-percent 6.8 10))
(center i)
(percent i)
(width i)
i
</pre>
</div>

<pre class="example">
6.8
9.999999999999996
0.6799999999999997
(6.12 . 7.4799999999999995)
</pre>
</div>
</div>

<div id="outline-container-org80b7078" class="outline-4">
<h4 id="org80b7078">Exercise 2.13 - Approximate product tolerance when percentages are small</h4>
<div class="outline-text-4" id="text-org80b7078">
<p>
Assume all bounds are positive numbers, for simplicity.
</p>

<p>
Consider the product of two intervals \(a \pm p\) and \(b \pm q\).
</p>

<p>
Their corresponding interval representation is \([a(1-p), a(1+p)]\) and \([b(1-q), b(1+q)]\).
</p>

<p>
As all bounds are assumed to be positive numbers, we can readily find the bounds of the product: \[[ab(1-p)(1-q), ab(1+p)(1+q)] = [ab(1 - (p+q) + pq), ab(1 + (p+q) + pq)\]
</p>

<p>
If \(p\) and \(q\) are small, \(pq\) is very small, we can neglect it for the approximation, and then \[(a \pm p) \times (b \pm q) \approx (ab \pm (p+q))\]
</p>
</div>
</div>

<div id="outline-container-org3f74a60" class="outline-4">
<h4 id="org3f74a60">Different results for algebraically equivalent expressions</h4>
<div class="outline-text-4" id="text-org3f74a60">
<div class="org-src-container">
<pre class="src src-racket" id="org6a9a6e1">(define (par1 r1 r2)
  (div-interval (mul-interval r1 r2)
		(add-interval r1 r2)))

(define (par2 r1 r2)
  (let ((one (make-interval 1 1)))
    (div-interval one
		  (add-interval (div-interval one r1)
				(div-interval one r2)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org70268a3" class="outline-4">
<h4 id="org70268a3"><span class="todo TODO">TODO</span> Exercise 2.14 - Demonstrate the bug</h4>
<div class="outline-text-4" id="text-org70268a3">
<div class="org-src-container">
<pre class="src src-racket" id="orgb77f61e">#lang sicp




(define (display-center-percent i)
  (define (round2 x) (/ (round (* 1000 x)) 1000))
  (display (round2 (center i)))
  (display "  ")
  (display (round2 (percent i)))
  (newline))

(define i1 (make-center-percent 6.8 10))
(define i2 (make-center-percent 6.8 7.5))
(define i3 (make-center-percent 6.8 4))
(define i4 (make-center-percent 6.8 2))

(define i5 (make-center-percent 4.7 5))

(newline)
(display "div by self:") (newline)
(display-center-percent (div-interval i1 i1))
(display-center-percent (div-interval i2 i2))
(display-center-percent (div-interval i3 i3))
(display-center-percent (div-interval i4 i4))

(newline)
(display "mul by self:") (newline)
(display-center-percent (mul-interval i1 i1))
(display-center-percent (mul-interval i2 i2))
(display-center-percent (mul-interval i3 i3))
(display-center-percent (mul-interval i4 i4))

(newline)
(display "div by same:") (newline)
(display-center-percent (div-interval i1 i5))
(display-center-percent (div-interval i2 i5))
(display-center-percent (div-interval i3 i5))
(display-center-percent (div-interval i4 i5))

(newline)
(display "same divided:") (newline)
(display-center-percent (div-interval i5 i1))
(display-center-percent (div-interval i5 i2))
(display-center-percent (div-interval i5 i3))
(display-center-percent (div-interval i5 i4))

(newline) (display "-------------------") (newline)


(display "r1: ") (display-center-percent i4)
(display "r2: ") (display-center-percent i5)

(newline)
(display "step-by-step par1") (newline)
(display "mul: ") (display-center-percent (mul-interval i4 i5))
(display "add: ") (display-center-percent (add-interval i4 i5))
(display "div: ") (display-center-percent (par1 i4 i5))

(newline)
(display "step-by-step par2") (newline)
(display "rec1: ") (display-center-percent (div-interval (make-interval 1 1) i4))
(display "rec2: ") (display-center-percent (div-interval (make-interval 1 1) i5))
(display "add: ") (display-center-percent (add-interval (div-interval (make-interval 1 1) i4)
							(div-interval (make-interval 1 1) i5)))
(display "rec: ") (display-center-percent (par2 i4 i5))

(newline)
(display "par examples:") (newline)
(display-center-percent (par1 i4 i5))
(display-center-percent (par2 i4 i5))


</pre>
</div>

<pre class="example" id="orga194862">

div by self:
1.02  19.802
1.011  14.916
1.003  7.987
1.001  3.998

mul by self:
46.702  19.802
46.5  14.916
46.314  7.987
46.258  3.998

div by same:
1.458  14.925
1.456  12.453
1.453  8.982
1.452  6.993

same divided:
0.702  14.925
0.698  12.453
0.694  8.982
0.692  6.993

-------------------
r1: 6.8  2.0
r2: 4.7  5.0

step-by-step par1
mul: 31.992  6.993
add: 11.5  3.226
div: 2.791  10.196

step-by-step par2
rec1: 0.147  2.0
rec2: 0.213  5.0
add: 0.36  3.775
rec: 2.779  3.775

par examples:
2.791  10.196
2.779  3.775
</pre>
</div>
</div>

<div id="outline-container-org9092b1c" class="outline-4">
<h4 id="org9092b1c"><span class="todo TODO">TODO</span> Exercise 2.15</h4>
</div>
<div id="outline-container-org3da999a" class="outline-4">
<h4 id="org3da999a"><span class="todo TODO">TODO</span> Exercise 2.16</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LMG</p>
<p class="date">Created: 2023-06-11 Sun 17:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
